---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.CanTotalByAssemblyType
source: html/bb92f36f-f3ef-9aa5-eb1e-50f830726f51.htm
---
# Autodesk.Revit.DB.ScheduleField.CanTotalByAssemblyType Method

Indicates if totals by assembly type can be enabled for this field.

## Syntax (C#)
```csharp
public bool CanTotalByAssemblyType()
```

## Returns
True if this field can be totaled by assembly type, false otherwise.